{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d9032357-e7dc-401a-912b-ff60dd2f8b1d",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "\n",
       "    if (typeof IPython !== \"undefined\") {\n",
       "        IPython.CodeCell.options_default.highlight_modes['application/sparql-query'] = {'reg':[/^%%rdf sparql/]};\n",
       "        IPython.CodeCell.options_default.highlight_modes['text/turtle'] = {'reg':[/^%%rdf turtle/, /^%%rdf shex/]};\n",
       "        IPython.CodeCell.options_default.highlight_modes['application/ld+json'] = {'reg':[/^%%rdf json-ld/]};\n",
       "        IPython.notebook.get_cells().map(function(cell){ if (cell.cell_type == 'code'){ cell.auto_highlight(); } });\n",
       "    }\n",
       "    "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%reload_ext jupyter-rdfify"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c9c547f3-ecf8-4105-b3b3-9884bec6e2de",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 6.0.1 (20220911.2005)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"945pt\" height=\"305pt\"\n",
       " viewBox=\"0.00 0.00 944.95 305.00\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 301)\">\n",
       "<polygon fill=\"white\" stroke=\"none\" points=\"-4,4 -4,-301 940.95,-301 940.95,4 -4,4\"/>\n",
       "<!-- 0 -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>0</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"713,-123 574,-123 574,-87 713,-87 713,-123\"/>\n",
       "<text text-anchor=\"middle\" x=\"643.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;3402.5&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 1 -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>1</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"139,-123 0,-123 0,-87 139,-87 139,-123\"/>\n",
       "<text text-anchor=\"middle\" x=\"69.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;2439.7&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 2 -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>2</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"92.5\" cy=\"-192\" rx=\"51.19\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"92.5\" y=\"-188.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:mercury</text>\n",
       "</g>\n",
       "<!-- 2&#45;&gt;1 -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>2&#45;&gt;1</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M87.85,-173.8C84.67,-162.05 80.39,-146.24 76.76,-132.84\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"80.14,-131.91 74.15,-123.18 73.38,-133.74 80.14,-131.91\"/>\n",
       "<text text-anchor=\"middle\" x=\"107.5\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 3 -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>3</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"925,-36 854,-36 854,0 925,0 925,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"889.5\" y=\"-14.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;Deimos&quot;</text>\n",
       "</g>\n",
       "<!-- 4 -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>4</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"777.5\" cy=\"-105\" rx=\"46.59\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"777.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:phobos</text>\n",
       "</g>\n",
       "<!-- 12 -->\n",
       "<g id=\"node13\" class=\"node\">\n",
       "<title>12</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"811.5,-36 743.5,-36 743.5,0 811.5,0 811.5,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"777.5\" y=\"-14.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;Phobos&quot;</text>\n",
       "</g>\n",
       "<!-- 4&#45;&gt;12 -->\n",
       "<g id=\"edge11\" class=\"edge\">\n",
       "<title>4&#45;&gt;12</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M777.5,-86.8C777.5,-75.16 777.5,-59.55 777.5,-46.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"781,-46.18 777.5,-36.18 774,-46.18 781,-46.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"801\" y=\"-57.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:name</text>\n",
       "</g>\n",
       "<!-- 5 -->\n",
       "<g id=\"node6\" class=\"node\">\n",
       "<title>5</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"426,-36 339,-36 339,0 426,0 426,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"382.5\" y=\"-14.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;Moon&quot;@en</text>\n",
       "</g>\n",
       "<!-- 6 -->\n",
       "<g id=\"node7\" class=\"node\">\n",
       "<title>6</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"296,-123 157,-123 157,-87 296,-87 296,-123\"/>\n",
       "<text text-anchor=\"middle\" x=\"226.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;6051.9&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 7 -->\n",
       "<g id=\"node8\" class=\"node\">\n",
       "<title>7</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"226.5\" cy=\"-192\" rx=\"42.49\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"226.5\" y=\"-188.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:venus</text>\n",
       "</g>\n",
       "<!-- 7&#45;&gt;6 -->\n",
       "<g id=\"edge14\" class=\"edge\">\n",
       "<title>7&#45;&gt;6</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M226.5,-173.8C226.5,-162.16 226.5,-146.55 226.5,-133.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"230,-133.18 226.5,-123.18 223,-133.18 230,-133.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"251.5\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 8 -->\n",
       "<g id=\"node9\" class=\"node\">\n",
       "<title>8</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"453,-123 314,-123 314,-87 453,-87 453,-123\"/>\n",
       "<text text-anchor=\"middle\" x=\"383.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;6372.8&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 9 -->\n",
       "<g id=\"node10\" class=\"node\">\n",
       "<title>9</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"583,-36 444,-36 444,0 583,0 583,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"513.5\" y=\"-14.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;1737.1&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 10 -->\n",
       "<g id=\"node11\" class=\"node\">\n",
       "<title>10</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"446,-210 287,-210 287,-174 446,-174 446,-210\"/>\n",
       "<text text-anchor=\"middle\" x=\"366.5\" y=\"-188.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;1392000.0&quot;^^xsd:double</text>\n",
       "</g>\n",
       "<!-- 11 -->\n",
       "<g id=\"node12\" class=\"node\">\n",
       "<title>11</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"502.5\" cy=\"-192\" rx=\"38.99\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"502.5\" y=\"-188.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:earth</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;8 -->\n",
       "<g id=\"edge8\" class=\"edge\">\n",
       "<title>11&#45;&gt;8</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M482.31,-176.58C464.13,-163.59 437.08,-144.27 415.88,-129.13\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"417.65,-126.1 407.48,-123.13 413.59,-131.79 417.65,-126.1\"/>\n",
       "<text text-anchor=\"middle\" x=\"475.5\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 15 -->\n",
       "<g id=\"node16\" class=\"node\">\n",
       "<title>15</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"513.5\" cy=\"-105\" rx=\"42.49\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"513.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:moon</text>\n",
       "</g>\n",
       "<!-- 11&#45;&gt;15 -->\n",
       "<g id=\"edge15\" class=\"edge\">\n",
       "<title>11&#45;&gt;15</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M504.73,-173.8C506.23,-162.16 508.25,-146.55 509.98,-133.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"513.46,-133.54 511.28,-123.18 506.52,-132.64 513.46,-133.54\"/>\n",
       "<text text-anchor=\"middle\" x=\"539\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 13 -->\n",
       "<g id=\"node14\" class=\"node\">\n",
       "<title>13</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"366.5\" cy=\"-279\" rx=\"33.6\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"366.5\" y=\"-275.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:sun</text>\n",
       "</g>\n",
       "<!-- 13&#45;&gt;2 -->\n",
       "<g id=\"edge6\" class=\"edge\">\n",
       "<title>13&#45;&gt;2</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M335.03,-272.04C304.61,-265.94 257.41,-255.59 217.5,-243 188.38,-233.81 156.42,-220.98 132.11,-210.61\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"133.43,-207.37 122.86,-206.63 130.66,-213.8 133.43,-207.37\"/>\n",
       "<text text-anchor=\"middle\" x=\"247\" y=\"-231.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 13&#45;&gt;7 -->\n",
       "<g id=\"edge17\" class=\"edge\">\n",
       "<title>13&#45;&gt;7</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M343.54,-265.74C331.5,-259.19 316.58,-250.87 303.5,-243 287.78,-233.54 270.63,-222.48 256.51,-213.17\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"258.42,-210.24 248.15,-207.63 254.55,-216.07 258.42,-210.24\"/>\n",
       "<text text-anchor=\"middle\" x=\"333\" y=\"-231.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 13&#45;&gt;10 -->\n",
       "<g id=\"edge16\" class=\"edge\">\n",
       "<title>13&#45;&gt;10</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M366.5,-260.8C366.5,-249.16 366.5,-233.55 366.5,-220.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"370,-220.18 366.5,-210.18 363,-220.18 370,-220.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"391.5\" y=\"-231.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 13&#45;&gt;11 -->\n",
       "<g id=\"edge5\" class=\"edge\">\n",
       "<title>13&#45;&gt;11</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M387.75,-264.72C410.2,-250.68 445.84,-228.41 471.44,-212.41\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"473.42,-215.3 480.04,-207.04 469.71,-209.37 473.42,-215.3\"/>\n",
       "<text text-anchor=\"middle\" x=\"473\" y=\"-231.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 14 -->\n",
       "<g id=\"node15\" class=\"node\">\n",
       "<title>14</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"695.5\" cy=\"-192\" rx=\"38.99\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"695.5\" y=\"-188.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:mars</text>\n",
       "</g>\n",
       "<!-- 13&#45;&gt;14 -->\n",
       "<g id=\"edge7\" class=\"edge\">\n",
       "<title>13&#45;&gt;14</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M396.57,-270.61C424.94,-263.6 468.65,-252.74 506.5,-243 556.89,-230.04 614.71,-214.67 652.98,-204.43\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"654,-207.78 662.76,-201.81 652.19,-201.01 654,-207.78\"/>\n",
       "<text text-anchor=\"middle\" x=\"594\" y=\"-231.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 14&#45;&gt;0 -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>14&#45;&gt;0</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M685.23,-174.21C677.8,-162.06 667.62,-145.43 659.18,-131.63\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"662.13,-129.75 653.93,-123.05 656.16,-133.41 662.13,-129.75\"/>\n",
       "<text text-anchor=\"middle\" x=\"697.5\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 14&#45;&gt;4 -->\n",
       "<g id=\"edge13\" class=\"edge\">\n",
       "<title>14&#45;&gt;4</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M710.92,-175.01C723.21,-162.27 740.61,-144.24 754.54,-129.8\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"757.44,-131.83 761.87,-122.21 752.4,-126.97 757.44,-131.83\"/>\n",
       "<text text-anchor=\"middle\" x=\"770\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 17 -->\n",
       "<g id=\"node18\" class=\"node\">\n",
       "<title>17</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"889.5\" cy=\"-105\" rx=\"47.39\" ry=\"18\"/>\n",
       "<text text-anchor=\"middle\" x=\"889.5\" y=\"-101.3\" font-family=\"Times,serif\" font-size=\"14.00\">ex:deimos</text>\n",
       "</g>\n",
       "<!-- 14&#45;&gt;17 -->\n",
       "<g id=\"edge9\" class=\"edge\">\n",
       "<title>14&#45;&gt;17</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M728.79,-182.21C750.5,-175.99 779.2,-166.85 803.5,-156 822.22,-147.64 842.07,-136.28 857.98,-126.51\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"860.22,-129.23 866.85,-120.97 856.51,-123.29 860.22,-129.23\"/>\n",
       "<text text-anchor=\"middle\" x=\"862\" y=\"-144.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:satellite</text>\n",
       "</g>\n",
       "<!-- 15&#45;&gt;5 -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>15&#45;&gt;5</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M491.28,-89.58C471.08,-76.48 440.95,-56.93 417.52,-41.72\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"419.2,-38.64 408.9,-36.13 415.39,-44.51 419.2,-38.64\"/>\n",
       "<text text-anchor=\"middle\" x=\"480\" y=\"-57.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:name</text>\n",
       "</g>\n",
       "<!-- 15&#45;&gt;9 -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>15&#45;&gt;9</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M513.5,-86.8C513.5,-75.16 513.5,-59.55 513.5,-46.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"517,-46.18 513.5,-36.18 510,-46.18 517,-46.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"538.5\" y=\"-57.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:radius</text>\n",
       "</g>\n",
       "<!-- 16 -->\n",
       "<g id=\"node17\" class=\"node\">\n",
       "<title>16</title>\n",
       "<polygon fill=\"none\" stroke=\"black\" points=\"679.5,-36 601.5,-36 601.5,0 679.5,0 679.5,-36\"/>\n",
       "<text text-anchor=\"middle\" x=\"640.5\" y=\"-14.3\" font-family=\"Times,serif\" font-size=\"14.00\">&quot;Lune&quot;@fr</text>\n",
       "</g>\n",
       "<!-- 15&#45;&gt;16 -->\n",
       "<g id=\"edge10\" class=\"edge\">\n",
       "<title>15&#45;&gt;16</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M535.92,-89.65C545.66,-83.37 557.18,-75.88 567.5,-69 580.69,-60.21 595.11,-50.38 607.62,-41.78\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"609.69,-44.61 615.94,-36.05 605.72,-38.84 609.69,-44.61\"/>\n",
       "<text text-anchor=\"middle\" x=\"613\" y=\"-57.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:name</text>\n",
       "</g>\n",
       "<!-- 17&#45;&gt;3 -->\n",
       "<g id=\"edge12\" class=\"edge\">\n",
       "<title>17&#45;&gt;3</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M889.5,-86.8C889.5,-75.16 889.5,-59.55 889.5,-46.24\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"893,-46.18 889.5,-36.18 886,-46.18 893,-46.18\"/>\n",
       "<text text-anchor=\"middle\" x=\"913\" y=\"-57.8\" font-family=\"Times,serif\" font-size=\"14.00\">ex:name</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x7f78c7605f90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf turtle --label planets\n",
    "\n",
    "@prefix ex: <http://example.org/> .\n",
    "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
    "\n",
    "ex:sun ex:radius \"1.392e6\"^^xsd:double ;\n",
    "ex:satellite ex:mercury , ex:venus , ex:earth , ex:mars .\n",
    "ex:mercury ex:radius \"2439.7\"^^xsd:double .\n",
    "ex:venus ex:radius \"6051.9\"^^xsd:double .\n",
    "ex:earth ex:radius \"6372.8\"^^xsd:double ;\n",
    "ex:satellite ex:moon .\n",
    "ex:mars ex:radius \"3402.5\"^^xsd:double ;\n",
    "ex:satellite ex:phobos, ex:deimos .\n",
    "ex:moon ex:name \"Lune\"@fr, \"Moon\"@en ;\n",
    "ex:radius \"1737.1\"^^xsd:double .\n",
    "ex:phobos ex:name \"Phobos\" .\n",
    "ex:deimos ex:name \"Deimos\" ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "dbfa9c5f-9f63-4dba-8415-9affc5c3a72a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?object</th><th>?center</th></tr><tr><td>http://example.org/sun</td><td>None</td></tr><tr><td>http://example.org/venus</td><td>http://example.org/sun</td></tr><tr><td>http://example.org/earth</td><td>http://example.org/sun</td></tr><tr><td>http://example.org/mars</td><td>http://example.org/sun</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql --local planets\n",
    "\n",
    "# Question A\n",
    "PREFIX ex: <http://example.org/>\n",
    "SELECT ?object ?center\n",
    "WHERE {\n",
    "    { ?object ex:radius ?rad . }\n",
    "    OPTIONAL { ?center ex:satellite ?object . }\n",
    "    FILTER (?rad > 3000)\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e68a921f-1e0e-41d9-814e-f5fd8efbaf4d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?object</th></tr><tr><td>http://example.org/earth</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql --local planets\n",
    "\n",
    "# Question C\n",
    "PREFIX ex: <http://example.org/>\n",
    "SELECT ?object\n",
    "WHERE {\n",
    "    ?object ex:satellite ?satellite .\n",
    "    ?satellite ex:name ?name .\n",
    "    ?center ex:satellite ?object .\n",
    "    ?center ex:radius ?rad .\n",
    "    FILTER (langMATCHES(LANG(?name), \"en\"))\n",
    "    FILTER (?rad > 3000)\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "fb2a081e-bf83-46d0-a276-70ce0ed13de8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>?object</th></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/sun</td></tr><tr><td>http://example.org/mars</td></tr><tr><td>http://example.org/mars</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%rdf sparql --local planets\n",
    "\n",
    "# Question B\n",
    "PREFIX ex: <http://example.org/>\n",
    "SELECT ?object\n",
    "WHERE {\n",
    "    ?object ex:satellite ?satellite1 .\n",
    "    ?object ex:satellite ?satellite2 .\n",
    "    FILTER (!sameTerm(?satellite1, ?satellite2))\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "673b4063-c733-4b9d-9a82-9b62f765ca82",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
